#include <stdio.h>

int main()
{
    const int N = 10; //Константа, кол-во єлєментів
    int max = 0; // Змінна 
    int a,b,e = 0; // Змінні 
    int c = 0;// Змінна 
    
    int arr[12] = {1,5,6,1,2,6,7,2,4,3}; //Масиви 
    
    for(int i = 0;i < N;i++){ //Цикл перерахунку масива 
        if(arr[i] > max){ // Находження максимальног єлємента
            max = arr[i];// Присвоення
        }
    }
        int min = arr[0]; // Присвоення
        
        for(int i = 0; i < N; ++i){ //Цикл перерахунку масива 
            if(arr[i] < min){ // Находження мінімального єлємента
                min = arr[i]; // Присвоення
        }
    }
   
    for(int i = 0;i < N;i++){ //Цикл перерахунку масива
        e += arr[i]; // Знайшли сумму єлементів масиву
    }
    b = e - min - max; // Прибираємо мінімальний і максимальний єлємент

    for(int l = 0; l < N;l++){ //Цикл перерахунку масива
        if(arr[l] < max && arr[l] > min){ //Умова при якій максимальний і мінімальний єлємент не пишеться 
        c = arr[l]; // Присвоення
        }
}
}